[
  {
    "id": "Nike",
      "position": "Machine Learning Engineer II",
      "title": "Nike",
      "startDate": "Mar 2025",
      "endDate": "Present",
      "technologies": "TBD",
      "description": "TBD",
      "image": "/Nike.png"
  },
  {
    "id": "Posh",
      "position": "Freelance Software Engineer",
      "title": "Posh",
      "startDate": "Jan 2025",
      "endDate": "Present",
      "technologies": "Typescript, React, Node, Express, MongoDB, Google Analytics, Webflow, Airtable, Mailgun",
      "description": "Revamped pug templates for Mailgun to apply new branding, enhancing email consistency and engagement. Designed and developed custom marketing websites using Webflow to showcase events and drive ticket sales. Collaborated with clients to ensure websites are aligned with their branding, event goals, and ticket sale objectives. Integrated Google Analytics to client websites, collecting insights on unique visitors, traffic, and user patterns",
      "image": "/Posh.png"
  },
  {
      "id": "SonicScript",
      "position": "Graduate Research Assistant",
      "title": "SonicScript",
      "startDate": "May 2023",
      "endDate": "Dec 2024",
      "technologies": "Unity, C#, Vuforia, OpenCV, ML models (CNN), Vuzix M4000 Smart Glasses",
      "description": "As a lead full stack engineer in human computer interaction, I independently designed and implemented a system for individuals with visual impairments, facilitating their learning of English character structures and writing with up to 90% accuracy. I worked under agile practices having weekly sprints and continuous integration and testing. The application leverages augmented reality and Vuzix M4000 smart glasses to assist users through a sequence of vector traces using sonification and verbal guidance. Utilizing Vuforia, the system tracks the users hand movement, comparing it to predefined points along letter traces. Throughout the tracing process, pitch and volume levels are adjusted to guide the user for enhanced learning and interaction. Upon completion of each stroke, the user will receive correctional feedback, determined by algorithms utilizing machine learning and computer vision, to enhance user accuracy by 30%. The project has already secured $1,000 for further research and development.",
      "image": "/SonicScriptImage.png"
    },
    {
      "id": "CourseAssistant",
      "position": "Graduate Course Assistant",
      "title": "SSW 625: AI for Software Engineering",
      "startDate": "Sep 2024",
      "endDate": "Dec 2024",
      "technologies": "Java, Maven, Github, Remote Desktop",
      "description": "Assisted professor in tool installation and setup, assignment grading, and responding to student inquiries.",
      "image": "/course assistant2.jpg"
    },
    {
      "id": "ART-022",
      "position": "Undergraduate Research Assistant",
      "title": "ART-022",
      "startDate": "May 2022",
      "endDate": "August 2022",
      "technologies": "Python, pandas, numpy, dash, plotly",
      "description": "As a user experience researcher and dashboard developer, I conducted an extensive case study of 800+ participants to assess the influence of visual dashboard features on strategic decision-making and user performance. Using Python, dash, plotly, numpy and pandas, I created eight distinct dashboard variants, each presenting a different set of visual elements. The study involved a task where users were tasked with constructing a catapult, allowing them to modify various metrics while adhering to specific requirements and limitations. Upon completion, participants were asked about their confidence levels in executing the task. Participants were sourced from Amazon Mechanical Turk for this study. In the course of this project, I also contributed by troubleshooting an artillery dashboard funded by the United States Department of Defense optimizing its user interface. ",
      "image": "/DashboardImage.png"
    },
    {
      "id": "MLB",
      "position": "Undergraduate Research Assistant",
      "title": "MLB Pitching Analysis",
      "startDate": "May 2021",
      "endDate": "August 2021",
      "technologies": "MATLAB, Mokka",
      "description": "As a data analyst researcher, I conducted an in-depth analysis of professional pitchers' joint movements by utilizing Mokka to plot data obtained from capturing both kinematic and kinetic data via force plates. My analysis involved the examination of angular incremental impulse data across various planes using MATLAB. I worked to mitigated potential deceleration injury risks by 15% through detailed joint movement analysis. Additionally, I employed linear incremental impulse within the sagittal plane and studied angular incremental impulse across the sagittal and transverse planes to determine the deceleration phase of each pitcher's motion which contributed to a 10% improvement in pitchers' overall performance metrics.",
      "image": "/MLBImage.png"
    },
    {
      "id": "Surivial",
      "position": "Lead Game Developer",
      "title": "Island Escape - Personal",
      "startDate": "May 2023",
      "endDate": "Present",
      "technologies": "Unity, C#, Shaders",
      "description": "This is a side project I have been working on to develop an open world, survival, story mode game. The premise of the game is that the user crash lands on an island and must interact with the natives, explore, survive, and complete quests to gather the resourses required to build a ship to leave the island. As part of this project I had designed the terrain and developed shaders to simulate the ocean tide and waves. I have also developed an inventory and storage system along with user interactions with wildlife. ",
      "image": "/IslandImage.png"
    },
    {
      "id": "Portfolio",
      "position": "Lead Web Developer",
      "title": "This Portfolio Website - Personal",
      "startDate": "May 2024",
      "endDate": "Present",
      "technologies": "Javascript, React, Next, CSS",
      "description": "This portfolio website was developed independently to showcase my skills as a web developer and my past and current projects.",
      "image": "hereImage.png"
    }

  ]